vbirjuko/EFM32_ROMI_Robot/profiler.c
      sigma_error += track_error;
      sigma_error = constrain(sigma_error, -2048, 2048);
//      if (sigma_error > 2048) sigma_error = 2048;
//      if (sigma_error < -2048) sigma_error = -2048;

      result = data.k_error*track_error + de_dt + ((sigma_error * data.k_integral) >> 10);

      if (speed < maxspeed) {
          if ((speed += data.acceleration) > maxspeed) speed = maxspeed;
      } else if (speed > maxspeed) {
          if ((speed -= data.acceleration) < maxspeed) speed = maxspeed;
      }

      int nom_speed = (speed < data.minspeed) ? data.minspeed : speed;
      left_speed  = speed+(result*nom_speed)/8192; // speed*(1+result/nom_speed)
      right_speed = speed-(result*nom_speed)/8192;

//      if (left_speed > data.maxmotor) left_speed = data.maxmotor;
//      else if (left_speed < -data.maxmotor) left_speed = -data.maxmotor;
//
//      if (right_speed > data.maxmotor) right_speed = data.maxmotor;
//      else if (right_speed < -data.maxmotor) right_speed = -data.maxmotor;

      Motor_Speed(left_speed, right_speed);

  }
  return 0;
}



unsigned int check_node(void) {
  unsigned int ii, photo_sensor;
  static unsigned int delay = 0, available = 0, blind = 0;


  if (photo_data_ready ) {
      unsigned int linecount = 0, prev_stat = 0;
      photo_data_ready  = 0;
      photo_sensor = current_sensor;
      LOGGING(log_check | (available << 4) | photo_sensor);

      if (delay) {
          delay--;
          if (photo_sensor == 0) blind = 1;
          if (delay == 0) {
              // now detect if we have straight segment
              if ((photo_sensor & ((1u << 2) | (1u << 3) | (1u << 4) | (1u << 5))) && !blind) {
                  available |= STRAIGHT_MASK;
              }

              // Тут передать информацию о конфигурации узла.

              node_configuration = available;
              //              segment_length = CURRENT_DISTANCE - startdistance + data.sensor_offset;
              LOGGING(log_segment0 | ((segment_length >>  0) & 0xFF));
              LOGGING(log_segment1 | ((segment_length >>  8) & 0xFF));
              LOGGING(log_segment2 | ((segment_length >> 16) & 0xFF));
              LOGGING(log_segment3 | ((segment_length >> 24) & 0xFF));
              profiler_data_ready = 1;

              delay = 0; blind = 0; available = 0;  // очистка перед следующим узлом.
              return 1;
          }
      } else {
          if (photo_sensor & ((1u << 0) | (1u << 7))) {  // есть отходы в сторону
              // проверка условия непрерывности линии
              unsigned int sensor_copy = photo_sensor;
              for (ii=0; ii < 8; ii++) {
                  if (prev_stat != (sensor_copy & 0x01)) {
                      if ((prev_stat = (sensor_copy & 0x01)) == 1) linecount++;
                  }
                  sensor_copy >>= 1;
              }
              // поворот детектируется только если есть одна непрерывная линия
              if (linecount == 1) {
                  if (photo_sensor & (1u << 7)) { available |= LEFT_MASK; }
                  if (photo_sensor & (1u << 0)) { available |= RIGHT_MASK; }
              }
          } else {  // больше нет отходов в стороны
              delay = 10; blind = 0;
          }
      } // delay

      Motor_Speed(speed, speed);
  } // photo_data_ready
  return 0;
}

// Торможение после анализа перекрёстка до скорости turnspeed.
unsigned int slowdown(void) {

  if (photo_data_ready) {
      photo_data_ready = 0;
      LOGGING(log_blind | current_sensor);
      if (CURRENT_DISTANCE < guarddistance) {
          if ((speed -= data.acceleration) < data.turnspeed) speed = data.turnspeed;
          Motor_Speed(speed, speed);
      } else {
          speed = 0; // ??????????????????????
          Motor_Speed(speed, speed);
          return 1;
      }
  }
  return 0;
}

unsigned int back_run(void) {
  if (photo_data_ready) {
      photo_data_ready = 0;
      LOGGING(log_back | current_sensor);
      if (CURRENT_DISTANCE > guarddistance) {
          if (CURRENT_DISTANCE > slowdistance) {
              if ((speed += data.acceleration) > data.maxspeed) speed = data.maxspeed;
          } else {
              if ((speed -= data.acceleration) < data.turnspeed) speed = data.turnspeed;
          }
          Motor_Speed(-speed, -speed);
      } else {
          speed = 0;
          Motor_Speed(speed, speed);
          return 1;
      }
  }
  return 0;
}

unsigned int blind_entrance(void) {
  static unsigned int find_line = 0, photo_sensor;
  if (photo_data_ready) {
      photo_data_ready = 0;
      photo_sensor = current_sensor;
      LOGGING(log_entrance | photo_sensor);
      if (photo_sensor) find_line++;
      else find_line = 0;

      if (find_line > 1) {
          find_line = 0;
          segment_length = CURRENT_DISTANCE - startdistance + data.sensor_offset;
          return 1;
      }

      if (CURRENT_DISTANCE < guarddistance) {
          if (CURRENT_DISTANCE < slowdistance) {
              if ((speed += data.acceleration) > data.maxspeed) speed = data.maxspeed;
          } else {
              if ((speed -= data.acceleration) < data.minspeed) speed = data.minspeed;
          }
          Motor_Speed(speed, speed);
      } else {
          find_line = 0;
          speed = 0; // ??????????????????????
          Motor_Speed(speed, speed);
          return 3;
      }
  }
  return 0;
}

unsigned int wait(void) {
  if (photo_data_ready) {
      photo_data_ready = 0;
      LOGGING(log_wait | current_sensor);
      return  !(wait_counter--);
  }
  return 0;
}


// returns 0 if OK, 1 if ERROR
static rotation_dir_t last_turn = right;
unsigned int  turn_dir, degree;
int stop_difference, fail_difference, slow_difference;

#define MAKE_TURN(DIFF, SENSOR, SPEEDL, SPEEDR)                                 \
  unsigned int photo_sensor;                                                    \
  static unsigned int count = 0, last_status = 0;                               \
  if (photo_data_ready ) {                                                      \
      photo_data_ready  = 0;                                                    \
      photo_sensor = current_sensor;                                            \
      LOGGING(log_turn | photo_sensor);                                         \
      if ((DIFF) < slow_difference) {                                           \
          if ((speed += data.acceleration) > data.maxmotor) speed = data.maxmotor;                     \
      } else {                                                                  \
          if ((speed -= data.acceleration) < data.turnspeed) speed = data.turnspeed;\
      }                                                                         \
                                                                                \
      if ((photo_sensor & (1 << SENSOR)) ^ last_status) count++;                \
      last_status = photo_sensor & (1 << SENSOR);                               \
      if ((DIFF) > fail_difference) {                                           \
          count = 0;                                                            \
          last_status = 0;                                                      \
          return 3;                                                             \
      }                                                                         \
      if (count == 2) {                                                         \
          if ((DIFF) < stop_difference) count = 0;                              \
          else {                                                                \
              speed = 0;                                                        \
              count = 0;                                                        \
              last_status = 0;                                                  \
              Motor_Speed(0, 0);                                                \
              return 1;                                                         \
          }                                                                     \
      }                                                                         \
      Motor_Speed(SPEEDL, SPEEDR);                                              \
  }                                                                             \
  return 0;

unsigned int make_turn_left(void) {  // Turn left
    MAKE_TURN(((int32_t)RightSteps - (int32_t)LeftSteps), (4), -speed, speed)
}

unsigned int make_turn_right(void) {  // Turn right.
    MAKE_TURN(((int32_t)LeftSteps - (int32_t)RightSteps), (3), speed, -speed)
}

