vbirjuko/EFM32_ROMI_Robot/profiler.c
typedef enum {
  idle,
  segment_run,
  check,
  blind_run,
  turn_right,
  turn_left,
  wait_still,
  do_entrance,
  blind_back
} command_state_t;

void profiler(void) {
  static command_state_t state = idle;
  unsigned int command, command_param, total_length, ii, cmd_status;
  int brakepath1, brakepath2;

  while (state == idle) {
      if (block_command_read) return;
      command  = get_command();
      command_param = command & ~COMMAND_MASK;
      profiler_queue_empty = 0;
      switch (command & COMMAND_MASK) {
        case command_eof:
          profiler_queue_empty = 1;
          return;

        case command_wait:
          wait_counter = command_param;
          state = wait_still;
          break;

        // движение прямо по сегменту. В младших битах длина сегмента для расчета разгона и торможения.
        // разделяется на 3 фазы: движение по прямой линии, исследование узла и выравнивание ЦТ над узлом.
        // так же проверяются следующие команды и если они тоже движение прямо, разгон и торможение расчитываются
        // с учетом последующих сегментов и тогда на промежуточных узлах выравнивание не выполняется.
        case command_forward:
          state = segment_run;
          Motor_Enable();
          total_length = command_param;
          if (total_length) {
              ii = 1;
              while ((((command = read_command(ii++)) & COMMAND_MASK) == command_forward) ||
                      ((command & COMMAND_MASK) == command_finish)) {
                  total_length += (command & ~COMMAND_MASK);
              }
          }
          if (speed == 0) startdistance = CURRENT_DISTANCE;
#ifdef SPEED_MM_PER_SECOND
          if (speed == 0) startdistance = CURRENT_DISTANCE;
          // Расстояние, необходимое для торможения, если максимальная скорость не набирается:
          // (V^2 - v^2) / (4 * a)  + distance/2
          // V = speed * 0.1
          // a = data.acceleration * 0.1 / FRAMESCANPERSECOND;
          brakepath1 = ((long long)(speed + data.minspeed)*(speed - data.minspeed)+(data.acceleration*2*10*FRAMESCANPERSECOND))/
                                    (data.acceleration*4*10*FRAMESCANPERSECOND) + total_length/2;
          // Расстояние, необходимое для торможения от максимальной скорости:
          // (V^2 - v^2) / (2 * a)
          brakepath2 = ((long long)(data.maxspeed + data.minspeed)*(data.maxspeed - data.minspeed)+(data.acceleration*10*FRAMESCANPERSECOND))/
                                    (data.acceleration*2*10*FRAMESCANPERSECOND);
#else
          // Расстояние, необходимое для торможения, если максимальная скорость не набирается:
          // (220mm/100)^2 * (V^2 - v^2) / (4 * a * 400*60)  + distance/2
          brakepath1 = (long long)(speed + data.minspeed)*(speed - data.minspeed) * 121/data.acceleration/2400000 + total_length/2;
          // Расстояние, необходимое для торможения от максимальной скорости:
          // (220mm/100)^2 * (V^2 - v^2) / (2 * a * 400*60)
          brakepath2 = (long long)(data.maxspeed + data.minspeed)*(data.maxspeed - data.minspeed) * 121/data.acceleration/1200000;
#endif
          // используем вариант с самым коротким тормозным путём
          if ((brakepath1 < brakepath2) && (brakepath1 >= 0)) {
              slowdistance = startdistance + total_length - data.sensor_offset - brakepath1;
          } else {
              slowdistance = startdistance + total_length - data.sensor_offset - brakepath2;
          }
          guarddistance = startdistance + data.guarddist;
          break;


        // Поворот в узле. В младших битах параметр поворота 1-вправо на 90 градусов,
        // 2- разворот на 180 градусов, 3-влево на 90 градусов.
        // любой другой аргумент приводит к отмене очереди команд. Направление разворота зависит
        // от предыдущего поворота и выполняется в противоположном направлении.
        // Если при выполнении поворота или разворота поворот по одометру не попадает в валидное
        // окно, то считается ошибкой и происходит отмена очереди команд.
        case command_turn:
          turn_dir = command_param;
          if (turn_dir == back) {
              degree = 180;
              turn_dir = (last_turn == left) ? right : left;
          } else {
              degree = 90;
          }

//          reset_steps();
          Motor_Enable();
//#define SLOW_DIST_OLD
          stop_difference = ((degree == 180) ? DEGREE_TO_STEPS(135) : DEGREE_TO_STEPS(45));
          fail_difference = ((degree == 180) ? DEGREE_TO_STEPS(270) : DEGREE_TO_STEPS(135));
#ifdef SLOW_DIST_OLD
          slow_difference = ((degree == 180) ? DEGREE_TO_STEPS(120) : DEGREE_TO_STEPS(60));
#else
          {
              int circle_length = (degree == 180) ? ((180 * TRACK_WIDE * 314)+(100*360/2)) / (100 * 360) : ((90 * TRACK_WIDE * 314)+(100*360/2)) / (100 * 360);
              int brakepath = (long long)data.maxmotor*data.maxmotor * 121/data.acceleration/1200000;
              if ((brakepath * 2) > circle_length) {
                  slow_difference = MM_TO_STEPS(circle_length/2);
              } else {
                  slow_difference = MM_TO_STEPS(circle_length - brakepath);
              }
          }
#endif
          switch (turn_dir) {
            case left:      // turn left
              last_turn = left;
              state = turn_left;
              stop_difference += ((int32_t)RightSteps - (int32_t)LeftSteps);
              slow_difference += ((int32_t)RightSteps - (int32_t)LeftSteps);
              fail_difference += ((int32_t)RightSteps - (int32_t)LeftSteps);
              break;

            case right:
              last_turn = right;
              state = turn_right;
              stop_difference += ((int32_t)LeftSteps - (int32_t)RightSteps);
              slow_difference += ((int32_t)LeftSteps - (int32_t)RightSteps);
              fail_difference += ((int32_t)LeftSteps - (int32_t)RightSteps);
              break;

            default:
              profiler_error_code = profiler_error_turn_arg;
              drop_command_queue();
              state = idle;
          }
          break;

        case command_entrance:
          state = do_entrance;
          speed = 0;
          Motor_Enable();
          total_length = command_param;
          if (total_length) {
              ii = 1;
              while (((command = read_command(ii++)) & COMMAND_MASK) == command_forward) {
                  total_length += (command & ~COMMAND_MASK);
              }
          }
          startdistance = CURRENT_DISTANCE;
#ifdef SPEED_MM_PER_SECOND
          if (speed == 0) startdistance = CURRENT_DISTANCE;
          // Расстояние, необходимое для торможения, если максимальная скорость не набирается:
          // (V^2 - v^2) / (4 * a)  + distance/2
          // V = speed * 0.1
          // a = data.acceleration * 0.1 / FRAMESCANPERSECOND;
          brakepath1 = ((long long)(speed + data.minspeed)*(speed - data.minspeed)+(data.acceleration*2*10*FRAMESCANPERSECOND))/
                                    (data.acceleration*4*10*FRAMESCANPERSECOND) + total_length/2;
          // Расстояние, необходимое для торможения от максимальной скорости:
          // (V^2 - v^2) / (2 * a)
          brakepath2 = ((long long)(data.maxspeed + data.minspeed)*(data.maxspeed - data.minspeed)+(data.acceleration*10*FRAMESCANPERSECOND))/
                                    (data.acceleration*2*10*FRAMESCANPERSECOND);
#else
          // Расстояние, необходимое для торможения, если максимальная скорость не набирается:
          // (220mm/100)^2 * (V^2 - v^2) / (4 * a * 400*60)  + distance/2
          brakepath1 = (long long)(speed + data.minspeed)*(speed - data.minspeed) * 121/data.acceleration/2400000 + total_length/2;
          // Расстояние, необходимое для торможения от максимальной скорости:
          // (220mm/100)^2 * (V^2 - v^2) / (2 * a * 400*60)
          brakepath2 = (long long)(data.maxspeed + data.minspeed)*(data.maxspeed - data.minspeed) * 121/data.acceleration/1200000;
#endif
          // используем вариант с самым коротким тормозным путём
          if ((brakepath1 < brakepath2) && (brakepath1 >= 0)) {
              slowdistance = startdistance + total_length - data.sensor_offset - brakepath1;
          } else {
              slowdistance = startdistance + total_length - data.sensor_offset - brakepath2;
          }
//          guarddistance = (data.cell_step) ? data.cell_step : 150;
          guarddistance = startdistance + command_param; //   15см защитный интервал
          break;


        // Проезжаем на 10 см вперед на скорости data.turnspeed, чтобы встать на финишное поле.
        case command_finish:
          state = blind_run;
          Motor_Enable();
          if (speed == 0) startdistance = CURRENT_DISTANCE;
          guarddistance = command_param;
          if (guarddistance == 0) guarddistance = 100;
          guarddistance += startdistance;
          break;

        case command_back:
          state = blind_back;
          Motor_Enable();
          guarddistance = CURRENT_DISTANCE - command_param;
          slowdistance  = CURRENT_DISTANCE - command_param/2;
          break;

        case command_benchmark:
          if (command_param) {
              benchmark_start();
          } else {
              benchmark_stop();
          }
          break;

        default:
          state = idle;
          profiler_error_code = profiler_error_cmd_err;
          drop_command_queue();
          break;
      }
//      break;
      // конец интерпретации команд.
  }

  switch (state) {
    // Состояния профайлера. switch (state) продолжение
    case segment_run:
      if (run_segment()) {
          state = check;
          guarddistance = startdistance = CURRENT_DISTANCE + data.sensor_offset;
      }
      break;

    case check:
      if (check_node()) {
          unsigned int next_command = read_command(1) & COMMAND_MASK;
          if ((next_command == command_forward) ||
              (next_command == command_finish)) {
              state = idle; // читаем следующую команду
          } else {
              state = blind_run;
          }
      }
      break;

    case blind_run:
      if ((read_command(1) & COMMAND_MASK) != command_forward){
          if (slowdown()) {
              speed = 0;
              Motor_Speed(0, 0);
              state = idle;
          }
      } else {
          state = idle;
      }
      break;

    case blind_back:
      if (back_run()) {
          speed = 0;
          Motor_Speed(0, 0);
          state = idle;
      }
      break;

    case wait_still:
      if (wait()) {
          state = idle;
          Motor_Disable();
      }
      break;

    case turn_left:
      if ((cmd_status = make_turn_left()) > 0) {
          speed = 0;
          state = idle;
          reset_steps();
          real_direction -= (degree == 90) ? 1 : 2;
          real_direction &= TURN_MASK;
          if (cmd_status > 1) {
              profiler_error_code = profiler_error_turn;
              drop_command_queue();
              state = idle;
          }
      }
      break;

    case turn_right:
      if ((cmd_status = make_turn_right()) > 0) {
          speed = 0;
          state = idle;
          reset_steps();
          real_direction += (degree == 90) ? 1 : 2;
          real_direction &= TURN_MASK;
          if (cmd_status > 1) {
              profiler_error_code = profiler_error_turn;
              drop_command_queue();
              state = idle;
          }
      }
      break;

    case do_entrance:
      if ((cmd_status = blind_entrance()) > 0) {
          state = idle;
          startdistance = CURRENT_DISTANCE + data.sensor_offset;
//          guarddistance = startdistance + data.guarddist;
//          state = segment_run;
          if (cmd_status > 1) {
              profiler_error_code = profiler_error_no_entrance;
              drop_command_queue();
              state = idle;
          }
      }
      break;

    default:
      if (state != idle) {
        profiler_error_code = profiler_error_state_err;
        drop_command_queue();
        state = idle;
      }
  }
}

void test_profile(void) {
  data_log_init();
  //  block_profiler(1);
  put_command(command_wait | 2 * FRAMESCANPERSECOND);
  put_command(command_entrance | (data.cell_step/2));
  put_command(command_forward);
  put_command(command_turn | left);
  put_command(command_forward | 350);
  put_command(command_forward | 300);
  put_command(command_wait | 1 * FRAMESCANPERSECOND);
  put_command(command_turn | back);
  put_command(command_wait | 1 * FRAMESCANPERSECOND);
  put_command(command_forward | 300);
  put_command(command_forward | 350);
  put_command(command_turn | right);
  put_command(command_forward);
  put_command(command_finish | 100);
  //  block_profiler(0);
  data_log_finish();
}

#ifdef PROFILER_PENDSV
void PendSVInit(void) {
  NVIC_SetPriority(PendSV_IRQn, PendSV_IRQ_priority);
}
#else
void PendSVInit(void) {
  CMU_ClockEnable(cmuClock_TIMER3, 1);
  NVIC_SetPriority(TIMER3_IRQn, PendSV_IRQ_priority);
  NVIC_EnableIRQ(TIMER3_IRQn);
  TIMER3->IEN = TIMER_IEN_CC0;
}
#endif

#ifdef PROFILER_PENDSV
void PendSV_Handler(void) {
  profiler();
}
#else

void TIMER3_IRQHandler(void) {
  if ((TIMER3->IEN & TIMER_IEN_CC0) && (TIMER3->IF & TIMER_IF_CC0)) {
      TIMER3->IFC = TIMER_IFC_CC0;
      profiler();
  }
}
#endif
